In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn.linear_model import LogisticRegression
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import metrics
from sklearn.neighbors import KNeighborsClassifier

In [2]:
train = pd.read_csv('train.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test = pd.read_csv('test.csv')

In [5]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
test['Age'].isnull().values.any()

True

In [7]:
trainNumAge = train.copy()

In [8]:
trainNumAge['Sex'] = trainNumAge['Sex'].map({'female': 1, 'male': 0})

In [9]:
trainNumAge.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [10]:
trainNumEmbarked = trainNumAge.copy()

In [11]:
trainNumEmbarked['Embarked'] = trainNumEmbarked['Embarked'].map({'S': 1, 'C': 2, 'Q': 3})

In [12]:
trainNumEmbarked.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,1.0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,1.0

In [13]:
trainNumEmbarked['Embarked'].isnull().values.any()

True

In [14]:
trainNumEmbarked['Embarked'].fillna(99, inplace=True)

In [15]:
trainNumEmbarked['Embarked'].isnull().values.any()

False

In [16]:
trainNumEmbarked['Age'].isnull().values.any()

True

In [17]:
# First we will try to get age in place of Nan
trainNoNan = trainNumEmbarked[['Survived','Pclass','Sex','SibSp','Parch','Fare','Embarked','Age']]

In [18]:
trainNoNan = trainNumEmbarked[trainNumEmbarked['Age'].notnull()]

In [19]:
trainNoNan.shape

(714, 12)

In [20]:
trainNan = trainNumEmbarked[trainNumEmbarked['Age'].isnull()]

In [21]:
trainNan.shape

(177, 12)

In [22]:
trainNoNan = trainNoNan[['Survived','Pclass','Sex','SibSp','Parch','Fare','Embarked','Age']]
ageTest = trainNan[['Survived','Pclass','Sex','SibSp','Parch','Fare','Embarked']]

In [23]:
ageX = trainNoNan[['Survived','Pclass','Sex','SibSp','Parch','Fare','Embarked']]
ageY = trainNoNan['Age']

In [52]:
ageX.head(10)

    Survived  Pclass  Sex  SibSp  Parch     Fare  Embarked
0          0       3    0      1      0   7.2500       1.0
1          1       1    1      1      0  71.2833       2.0
2          1       3    1      0      0   7.9250       1.0
3          1       1    1      1      0  53.1000       1.0
4          0       3    0      0      0   8.0500       1.0
6          0       1    0      0      0  51.8625       1.0
7          0       3    0      3      1  21.0750       1.0
8          1       3    1      0      2  11.1333       1.0
9          1       2    1      1      0  30.0708       2.0
10         1       3    1      1      1  16.7000       1.0

In [25]:
ageY.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [53]:
ageTest.head(10)

    Survived  Pclass  Sex  SibSp  Parch      Fare  Embarked
5          0       3    0      0      0    8.4583       3.0
17         1       2    0      0      0   13.0000       1.0
19         1       3    1      0      0    7.2250       2.0
26         0       3    0      0      0    7.2250       2.0
28         1       3    1      0      0    7.8792       3.0
29         0       3    0      0      0    7.8958       1.0
31         1       1    1      1      0  146.5208       2.0
32         1       3    1      0      0    7.7500       3.0
36         1       3    0      0      0    7.2292       2.0
42         0       3    0      0      0    7.8958       2.0

In [38]:
X = ageX.to_numpy()

In [39]:
y = ageY.to_numpy()

In [40]:
test = ageTest.to_numpy()

In [41]:
X = np.around(X)
y = np.around(y)
test = np.around(test)

In [43]:
X = X.astype(int)
y = y.astype(int)
test = test.astype(int)

In [62]:
# instantiate the model (using the default parameters)
logreg = LogisticRegression()

# fit the model with data
logreg.fit(X, y)

# predict the response values for the observations in X
logreg.predict(test)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:460: FutureWarning: Default multi_class will be changed to 'auto' in 0.22. Specify the multi_class option to silence this warning.
  "this warning.", FutureWarning)

array([30, 32, 30, 20, 30, 21, 24, 30, 32, 20, 21, 32, 30, 25, 27, 30,  1,
       21, 21, 30, 21, 21, 21, 32, 30, 21, 30, 24, 18, 20, 21,  2, 24, 28,
        9,  2, 30, 36, 30, 30, 30,  2, 20, 21,  2, 22, 30, 30, 20, 30, 30,
       30, 36, 30, 20, 28, 30, 27, 30, 32, 30, 21, 24,  2, 30, 35, 21, 24,
       36, 20, 30, 30, 32, 30, 30, 24, 21, 30,  2, 21, 30, 20, 22, 20, 20,
       30, 24, 32, 21, 21, 24, 30, 21, 20, 30, 20, 36, 20,  2, 21, 22, 21,
       30, 27, 21, 30, 20, 20, 35, 20, 24, 21, 32, 30, 35, 30, 21, 22, 20,
       30, 30, 30, 21, 40, 22, 20, 21, 36, 20, 30, 30, 30, 20, 21, 32, 21,
       21, 30, 21, 21, 24, 20, 30, 32, 30,  1, 28, 30, 30, 20, 21, 21, 27,
       21, 30, 32, 20, 30, 30, 24, 30,  2, 30, 20, 30, 21, 32, 20, 21, 32,
        2, 24, 20,  2, 21, 21, 18])

In [63]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.4, random_state=4)

In [64]:
# STEP 2: train the model on the training set
logreg.fit(X_train, y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:460: FutureWarning: Default multi_class will be changed to 'auto' in 0.22. Specify the multi_class option to silence this warning.
  "this warning.", FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)